Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-patterns_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: You will see several visual states one by one:
ja: 複数の視覚的な状態を 1 つずつ見ることができます。

source: * **Receded**: For a second, you will see the `Loading the app...` fallback.
ja: * **Receded**: 1 秒間、`Loading the app...` フォールバックが表示されます。

source: * **Skeleton:** You will see the `<ProfilePage>` component with `Loading posts...` inside.
ja: * **Skeleton:** `<ProfilePage>` コンポーネントが表示され、中で `Loading posts...` が表示されます。

source: * **Complete:** You will see the `<ProfilePage>` component with no fallbacks inside.
ja: * **Complete:** `<ProfilePage>` コンポーネントが表示され、内部のフォールバックも表示されません。

source: Everything was fetched.
ja: すべてのデータは取得済みです。

source: How do we separate the Receded and the Skeleton states?
ja: Receded 状態と Skeleton 状態はどのように区別するのでしょうか？

source: The difference between them is that the **Receded** state feels like "taking a step back" to the user, while the **Skeleton** state feels like "taking a step forward" in our progress to show more content.
ja: これらの違いは、**Receded** 状態はユーザからは「一歩後退中」のように見え、**Skeleton** 状態はより多くのコンテンツを見せるべく「一歩前進中」のように見えるということです。

source: In this example, we started our journey on the `<HomePage>`:
ja: 今回の例は `<HomePage>` 画面から始まっています：

source: After the click, React started rendering the next screen:
ja: クリックすることで React は次の画面のレンダーを始めました：

source: Both `<ProfileDetails>` and `<ProfileTimeline>` need data to render, so they suspend:
ja: `<ProfileDetails>` も `<ProfileTimeline>` もレンダーするのにデータが必要なので、サスペンドします：

source: When a component suspends, React needs to show the closest fallback.
ja: コンポーネントがサスペンドすると、React は直近にあるフォールバックを表示する必要があります。

source: But the closest fallback to `<ProfileDetails>` is at the top level:
ja: しかし `<ProfileDetails>` の直近のフォールバックはトップレベルにあります：

source: This is why when we click the button, it feels like we've "taken a step back".
ja: これがボタンをクリックしたときに「一歩後退した」ように感じられる理由です。

source: The `<Suspense>` boundary which was previously showing useful content (`<HomePage />`) had to "recede" to showing the fallback (`Loading the app...`).
ja: 既に意味のあるコンテンツを表示していた `<Suspense>` バウンダリが一歩後退 (recede) してフォールバック (`Loading the app...`) を表示しなければなりませんでした。

source: We call that a **Receded** state.
ja: このことを **Receded** 状態と呼びます。

source: As we load more data, React will retry rendering, and `<ProfileDetails>` can render successfully.
ja: データをロードするにつれて、React は再レンダーを試み、`<ProfileDetails>` はうまく表示されるようになります。

source: Finally, we're in the **Skeleton** state.
ja: ついに **Skeleton** 状態に来たわけです。

source: We see the new page with missing parts:
ja: 一部が欠けた新しいページが見えるようになります。

source: Eventually, they load too, and we get to the **Complete** state.
ja: いずれ欠けている部分もロードされ、**Complete** 状態に至ります。

source: This scenario (Receded → Skeleton → Complete) is the default one.
ja: このシナリオ (Receded → Skeleton → Complete) がデフォルトです。

source: However, the Receded state is not very pleasant because it "hides" existing information.
ja: しかし、Receded 状態は既に存在する情報を「隠す」ことになるのであまり嬉しいものではありません。

source: This is why React lets us opt into a different sequence (**Pending** → Skeleton → Complete) with `useTransition`.
ja: これが React が `useTransition` によって別のシーケンス (**Pending** → Skeleton → Complete) を利用できるようにしている理由です。

source: ### Preferred: Pending → Skeleton → Complete {#preferred-pending-skeleton-complete}
ja: ### 推奨：Pending → Skeleton → Complete {#preferred-pending-skeleton-complete}

source: When we `useTransition`, React will let us "stay" on the previous screen -- and show a progress indicator there.
ja: `useTransition` を使うと、React は前の画面に「留まって」、そちらで進行状況のインジケータを表示できるようにさせてくれます。

source: We call that a **Pending** state.
ja: この状態を **Pending** 状態と呼びます。

source: It feels much better than the Receded state because none of our existing content disappears, and the page stays interactive.
ja: これは既存のコンテンツが消えてしまうことがなく、ページの操作性が保たれるので、Receded 状態よりもずっと良いものに感じられます。

source: You can compare these two examples to feel the difference:
ja: 以下の 2 つの例を比較して、違いを感じてみてください：

source: * Default: [Receded → Skeleton → Complete](https://codesandbox.io/s/prod-grass-g1lh5) * **Preferred: [Pending → Skeleton → Complete](https://codesandbox.io/s/focused-snow-xbkvl)**
ja: * デフォルト：[Receded → Skeleton → Complete](https://codesandbox.io/s/prod-grass-g1lh5) * **推奨：[Pending → Skeleton → Complete](https://codesandbox.io/s/focused-snow-xbkvl)**

source: The only difference between these two examples is that the first uses regular `<button>`s, but the second one uses our custom `<Button>` component with `useTransition`.
ja: この 2 つの例の唯一の違いは、前者が標準の `<button>` を使っており、後者は `useTransition` を使ったカスタムの `<Button>` を使っている、ということです。

source: ### Wrap Lazy Features in `<Suspense>` {#wrap-lazy-features-in-suspense}
ja: ### 遅延可能な機能を `<Suspense>` でラップする {#wrap-lazy-features-in-suspense}

source: Open [this example](https://codesandbox.io/s/nameless-butterfly-fkw5q).
ja: [こちらの例](https://codesandbox.io/s/nameless-butterfly-fkw5q)を開いてください。

source: When you press a button, you'll see the Pending state for a second before moving on.
ja: ボタンを押下すると、先に進む前に Pending 状態が 1 秒間表示されます。

source: This transition feels nice and fluid.
ja: このトランジションはスムースで良いものに感じられます。

source: We will now add a brand new feature to the profile page -- a list of fun facts about a person:
ja: ここでプロフィールページに新たな機能を付け加えましょう -- その人に関する豆知識（トリビア）のリストです：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/focused-mountain-uhkzg)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/focused-mountain-uhkzg)**

source: If you press "Open Profile" now, you can tell something is wrong.
ja: "Open Profile" を押下すると、何かおかしいことに気付くでしょう。

source: It takes a whole seven seconds to make the transition now!
ja: トランジションが完了するまで丸々 7 秒間もかかっているのです！

source: This is because our trivia API is too slow.
ja: これは我々のトリビア API がとても遅いからです。

source: Let's say we can't make the API faster.
ja: 仮に、この API はこれ以上高速化できないということにしましょう。

source: How can we improve the user experience with this constraint?
ja: この制限下で、ユーザ体験をどのように向上させればよいでしょうか。

source: If we don't want to stay in the Pending state for too long, our first instinct might be to set `timeoutMs` in `useTransition` to something smaller, like `3000`.
ja: Pending 状態にあまり留まりたくないという場合、直感的には `useTransition` の `timeoutMs` を小さな値、例えば `3000` にすればよいと思うかもしれません。

source: You can try this [here](https://codesandbox.io/s/practical-kowalevski-kpjg4).
ja: これを[こちら](https://codesandbox.io/s/practical-kowalevski-kpjg4)で試すことができます。

source: This lets us escape the prolonged Pending state, but we still don't have anything useful to show!
ja: これで遷延している Pending 状態から脱出することはできますが、意味のある内容はまだ何も表示されません！

source: There is a simpler way to solve this.
ja: よりシンプルな解決法があります。

source: **Instead of making the transition shorter, we can "disconnect" the slow component from the transition** by wrapping it into `<Suspense>`:
ja: **トランジションを短くするのではなく、遅いコンポーネントをトランジションから「切り離し」する**ために、`<Suspense>` でラップするのです。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/condescending-shape-s6694)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/condescending-shape-s6694)**

source: This reveals an important insight.
ja: ここに重要な見識が見いだされています。

source: React always prefers to go to the Skeleton state as soon as possible.
ja: React は常に可能な限り速く Skeleton 状態に移行しようとします。

source: Even if we use transitions with long timeouts everywhere, React will not stay in the Pending state for longer than necessary to avoid the Receded state.
ja: 長いタイムアウトをあらゆる場所で使ったとしても、React は、Receded 状態を避けるために必要な時間を超えて Pending 状態に留まるということをしません。

source: **If some feature isn't a vital part of the next screen, wrap it in `<Suspense>` and let it load lazily.
ja: **ある機能が次の画面に必須なものではない場合は、それを `<Suspense>` でラップして、遅延読み込みさせてください。

source: ** This ensures we can show the rest of the content as soon as possible.
ja: **これにより、残りのコンテンツを可能な限り素早く表示できるようになります。

source: Conversely, if a screen is *not worth showing* without some component, such as `<ProfileDetails>` in our example, do *not* wrap it in `<Suspense>`.
ja: 逆に、あるコンポーネントがないと次の画面の*表示自体が無価値*であるという場合（例えば我々の例の `<ProfileDetails>`）、そのコンポーネントを `<Suspense>` で囲んでは*いけません*。

source: Then the transitions will "wait" for it to be ready.
ja: こうすることで、トランジションはそれが準備できるまで「待つ」ようになります。

source: ### Suspense Reveal "Train" {#suspense-reveal-train}
ja: ### 「電車」式のサスペンス開放 {#suspense-reveal-train}

source: When we're already on the next screen, sometimes the data needed to "unlock" different `<Suspense>` boundaries arrives in quick succession.
ja: 既に次の画面にいるとして、時に複数の `<Suspense>` バウンダリを開放 (unlock) するのに必要なデータが矢継ぎ早にやってくるということがあります。

source: For example, two different responses might arrive after 1000ms and 1050ms, respectively.
ja: 例えば、2 つの異なったレスポンスがそれぞれ 1000ms 後と 1050ms 後にやってくる、ということがあるかもしれません。

source: If you've already waited for a second, waiting another 50ms is not going to be perceptible.
ja: 既に 1 秒間待っていたのなら、追加で 50ms 待ったとしても知覚できないでしょう。

source: This is why React reveals `<Suspense>` boundaries on a schedule, like a "train" that arrives periodically.
ja: このため、React は `<Suspense>` バウンダリ内のコンテンツを、一定間隔でやってくる「電車」のように、定期的に開放します。

source: This trades a small delay for reducing the layout thrashing and the number of visual changes presented to the user.
ja: これで、僅かな遅延と引き替えに、バタバタとレイアウトを行ってユーザに視覚上の変化を見せる回数を減らすことができます。

source: You can see a demo of this [here](https://codesandbox.io/s/admiring-mendeleev-y54mk).
ja: このデモを[こちら](https://codesandbox.io/s/admiring-mendeleev-y54mk)で見ることができます。

source: The "posts" and "fun facts" responses come within 100ms of each other.
ja: タイムライン投稿用と豆知識用のレスポンスは 100 ミリ秒未満の時間差で返ります。

source: But React coalesces them and "reveals" their Suspense boundaries together.
ja: しかし React はそれらを結合してサスペンスのバウンダリをまとめて「開放」します。

source: ### Delaying a Pending Indicator {#delaying-a-pending-indicator}
ja: ### Pending インジケータの遅延 {#delaying-a-pending-indicator}

source: Our `Button` component will immediately show the Pending state indicator on click:
ja: 我々の `Button` コンポーネントはクリックした直後に Pending 状態のインジケータを表示します。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/floral-thunder-iy826)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/floral-thunder-iy826)**

source: This signals to the user that some work is happening.
ja: これにより何らかの作業が行われているとユーザに伝えます。

source: However, if the transition is relatively short (less than 500ms), it might be too distracting and make the transition itself feel *slower*.
ja: しかし、トランジションが比較的短い場合（500ms 以内）、これにより気が散ってしまい、トランジション自体が*遅く*感じられるようになってしまいます。

source: One possible solution to this is to *delay the spinner itself* from displaying:
ja: 解決法の 1 つは、*スピナー自体*の表示を遅延させることです。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/gallant-spence-l6wbk)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/gallant-spence-l6wbk)**

source: With this change, even though we're in the Pending state, we don't display any indication to the user until 500ms has passed.
ja: この変更により、Pending 状態にいる場合でも、500 ms が経過するまでは何のインジケータも表示しないようになります。

source: This may not seem like much of an improvement when the API responses are slow.
ja: これは API のレスポンスが遅い場合には大した改善のように思えないかもしれません。

source: But compare how it feels [before](https://codesandbox.io/s/thirsty-liskov-1ygph) and [after](https://codesandbox.io/s/hardcore-http-s18xr) when the API call is fast.
ja: しかし API 呼び出しが速い場合にどう違って感じられるか、[改善前](https://codesandbox.io/s/thirsty-liskov-1ygph)と[改善後](https://codesandbox.io/s/hardcore-http-s18xr)を比較してみてください。

source: Even though the rest of the code hasn't changed, suppressing a "too fast" loading state improves the perceived performance by not calling attention to the delay.
ja: コードの残りの部分は変わっていないにもかかわらず、「あまりに早すぎる」ロード中状態を抑制すると、遅延に意識を向けさせないことにより体感上のパフォーマンスは向上します。

source: ### Recap {#recap}
ja: ### まとめ {#recap}

source: The most important things we learned so far are:
ja: ここまでで学んだ重要なことは以下の通りです：

source: * By default, our loading sequence is Receded → Skeleton → Complete.
ja: * デフォルトでは、ローディングシーケンスは Receded → Skeleton → Complete である。

source: * The Receded state doesn't feel very nice because it hides existing content.
ja: * Receded 状態は既存のコンテンツを隠してしまうため体感上良く感じられない。

source: * With `useTransition`, we can opt into showing a Pending state first instead.
ja: * `useTransition` を使ことで、選択的に Pending 状態を表示するようにできる。

source: This will keep us on the previous screen while the next screen is being prepared.
ja: これにより次の画面の準備をしている間、前の画面に留まることが可能になる。

source: * If we don't want some component to delay the transition, we can wrap it in its own `<Suspense>` boundary.
ja: * あるコンポーネントによりトランジションが遅延するのを避けたい場合、それを個別の `<Suspense>` バウンダリでラップする。

source: * Instead of doing `useTransition` in every other component, we can build it into our design system.
ja: * `useTransition` をあらゆるコンポーネントで使う代わりに、デザインシステムに組み込むことができる。

source: ## Other Patterns {#other-patterns}
ja: ## 他のパターン {#other-patterns}

source: Transitions are probably the most common Concurrent Mode pattern you'll encounter, but there are a few more patterns you might find useful.
ja: トランジションは、並列モードにおいておそらく最も一般的に遭遇するパターンですが、他にも有用かもしれないパターンが幾つかあります。

source: ### Splitting High and Low Priority State {#splitting-high-and-low-priority-state}
ja: ### 高優先度 state と低優先度 state の分割 {#splitting-high-and-low-priority-state}

source: When you design React components, it is usually best to find the "minimal representation" of state.
ja: React コンポーネントの設計において、通常は state の「最小の表現」を見つけることがベストです。

source: For example, instead of keeping `firstName`, `lastName`, and `fullName` in state, it's usually better keep only `firstName` and `lastName`, and then calculate `fullName` during rendering.
ja: 例えば、`firstName`、`lastName` と `fullName` を state に保持するよりも、`firstName` と `lastName` だけを保持して `fullName` はレンダー中に計算する方が通常は望ましいでしょう。

source: This lets us avoid mistakes where we update one state but forget the other state.
ja: これにより片方の state を更新してもう片方の state のことを忘れるという間違いを避けられます。

source: However, in Concurrent Mode there are cases where you might *want* to "duplicate" some data in different state variables.
ja: しかし並列モードでは、複数の state 変数にあるデータを「重複」*させたい*という場合があります。

source: Consider this tiny translation app:
ja: 以下のミニ翻訳アプリを考えてみましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/brave-villani-ypxvf)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/brave-villani-ypxvf)**

source: Notice how when you type into the input, the `<Translation>` component suspends, and we see the `<p>Loading...</p>` fallback until we get fresh results.
ja: 入力欄にタイプすると `<Translation>` コンポーネントがサスペンドし、新しい翻訳結果が手に入るまで `<p>Loading...</p>` というフォールバックが表示されることに気付くでしょう。

source: This is not ideal.
ja: これは良くありません。

source: It would be better if we could see the *previous* translation for a bit while we're fetching the next one.
ja: 新しい翻訳結果を取得している間、*前の*翻訳結果が表示されつづけている方が望ましいでしょう。

source: In fact, if we open the console, we'll see a warning:
ja: 実は、コンソールを開くと、以下のような警告が表示されています：

source: As we mentioned earlier, if some state update causes a component to suspend, that state update should be wrapped in a transition.
ja: 以前述べたとおり、state の更新がコンポーネントのサスペンドを引き起こす場合、その state 更新はトランジションでラップされるべきです。

source: Let's add `useTransition` to our component:
ja: ではこのコンポーネントに `useTransition` を追加してみましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/zen-keldysh-rifos)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/zen-keldysh-rifos)**

source: Try typing into the input now.
ja: 入力欄でタイピングしてみてください。

source: Something's wrong!
ja: 何かが変です！

source: The input is updating very slowly.
ja: 入力欄の更新が非常に遅くなっています。

source: We've fixed the first problem (suspending outside of a transition).
ja: 元の問題（トランジション外でサスペンドが起こる）は解決しました。

source: But now because of the transition, our state doesn't update immediately, and it can't "drive" a controlled input!
ja: が、このトランジションのせいで、state がすぐに更新されず、制御された入力欄を「駆動」することができなくなってしまいました！

source: The answer to this problem **is to split the state in two parts:** a "high priority" part that updates immediately, and a "low priority" part that may wait for a transition.
ja: この問題の答えは、**state を 2 つに分割して**、即座に更新される「高優先度」の部分と、トランジションを待つことのできる「低優先度」の部分に分けることです。

source: In our example, we already have two state variables.
ja: 我々の例には、すでに 2 つの state 変数があります。

source: The input text is in `query`, and we read the translation from `resource`.
ja: 入力中のテキストは `query` に入っており、翻訳結果は `resource` から読み出します。

source: We want changes to the `query` state to happen immediately, but changes to the `resource` (i.e. fetching a new translation) should trigger a transition.
ja: `query` state の更新は即座に反映される一方で、`resource` の更新（つまり新しい翻訳結果の取得）はトランジションを開始する必要があります。

source: So the correct fix is to put `setQuery` (which doesn't suspend) *outside* the transition, but `setResource` (which will suspend) *inside* of it.
ja: 従って正しい修正方法は `setQuery`（サスペンドしない）をトランジションの*外部*に持っていき、`setResource`（サスペンドする）を*内部*に持っていくことです。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/lively-smoke-fdf93)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/lively-smoke-fdf93)**

source: With this change, it works as expected.
ja: これで期待通りに動作するようになりました。

source: We can type into the input immediately, and the translation later "catches up" to what we have typed.
ja: 入力欄には即座にタイプでき、トランジションはタイプした内容にいずれ「追いつく」ようになります。

source: ### Deferring a Value {#deferring-a-value}
ja: ### 値の遅延 {#deferring-a-value}

source: By default, React always renders a consistent UI.
ja: デフォルトでは React は常に整合性のある UI を表示します。

source: Consider code like this:
ja: 以下のようなコードを考えましょう：

source: React guarantees that whenever we look at these components on the screen, they will reflect data from the same `user`.
ja: React は、これらのコンポーネントを画面上でどんなタイミングで見ても、同じ `user` からのデータが反映されていることを保証します。

source: If a different `user` is passed down because of a state update, you would see them changing together.
ja: state の更新によって別の `user` が渡された場合、両方が同時に変化します。

source: You can't ever record a screen and find a frame where they would show values from different `user`s. (If you ever run into a case like this, file a bug!)
ja: 画面を録画しても、別の `user` からの値が表示されているということはただの 1 フレームすらあり得ません（万一こんなことがあったらバグを登録してください！）。

source: This makes sense in the vast majority of situations.
ja: これは大多数の状況では理にかなっています。

source: Inconsistent UI is confusing and can mislead users. (For example, it would be terrible if a messenger's Send button and the conversation picker pane "disagreed" about which thread is currently selected.)
ja: UI の不整合は混乱を招き、ユーザを欺くことになります（例えば、メッセンジャーの「送信」ボタンと会話選択ペインとが合致せず、どのスレッドが現在選択されているか分からなくなったら最悪です）。

source: However, sometimes it might be helpful to intentionally introduce an inconsistency.
ja: しかし、意図的に不整合性を導入することが有用であることがあります。

source: We could do it manually by "splitting" the state like above, but React also offers a built-in Hook for this:
ja: これは上記のように state を手動で「分割」することでも行えますが、React はこのための組み込みフックも提供します：

source: To demonstrate this feature, we'll use [the profile switcher example](https://codesandbox.io/s/musing-ramanujan-bgw2o).
ja: この機能をデモするために[プロフィール切り替えの例](https://codesandbox.io/s/musing-ramanujan-bgw2o)を使いましょう。

source: Click the "Next" button and notice how it takes 1 second to do a transition.
ja: "Next" ボタンをクリックして、トランジションに 1 秒かかることを確かめてください。

source: Let's say that fetching the user details is very fast and only takes 300 milliseconds.
ja: 仮に、ユーザ詳細の取得は非常に高速で、300 ミリ秒しかかからないとしましょう。

source: Currently, we're waiting a whole second because we need both user details and posts to display a consistent profile page.
ja: 現在のところ、一貫性のあるプロフィールページを表示するにはユーザ詳細と投稿の両方が必要なので、まるまる 1 秒間待機しています。

source: But what if we want to show the details faster?
ja: ユーザ詳細だけ早めに表示したい場合はどうしたらいいのでしょうか？

source: If we're willing to sacrifice consistency, we could **pass potentially stale data to the components that delay our transition**.
ja: 一貫性を犠牲にしても構わないのであれば、**トランジションを遅延させているコンポーネントに古くなっているかもしれない値を渡す**ことができます。

source: That's what `useDeferredValue()` lets us do:
ja: これが `useDeferredValue()` によって可能になることです。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/vigorous-keller-3ed2b)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/vigorous-keller-3ed2b)**

source: The tradeoff we're making here is that `<ProfileTimeline>` will be inconsistent with other components and potentially show an older item.
ja: ここで生まれたトレードオフは、`<ProfileTimeline>` は他のコンポーネントとの整合性が保たれず、古いアイテムを表示するかもしれない、ということです。

source: Click "Next" a few times, and you'll notice it.
ja: "Next" を何度かクリックすると分かるでしょう。

source: But thanks to that, we were able to cut down the transition time from 1000ms to 300ms.
ja: しかしこのお陰で、トランジションにかかる時間が 1000ms から 300ms になりました。

source: Whether or not it's an appropriate tradeoff depends on the situation.
ja: これが適切なトレードオフなのかどうかは状況によります。

source: But it's a handy tool, especially when the content doesn't change noticeably between items, and the user might not even realize they were looking at a stale version for a second.
ja: しかしこれは有用なツールであり、特にコンテンツの変化があまり目立たず、ユーザが古い情報を一瞬見ていることに気付きすらしないような場合には有用です。

source: It's worth noting that `useDeferredValue` is not *only* useful for data fetching.
ja: `useDeferredValue` はデータ取得のときに*のみ*有用であるというわけではない、ということを知っておいてください。

source: It also helps when an expensive component tree causes an interaction (e.g. typing in an input) to be sluggish.
ja: これは高価な計算が必要なコンポーネントツリーがユーザ操作（テキスト入力へのタイピングなど）を遅くしている場合にも有効です。

source: Just like we can "defer" a value that takes too long to fetch (and show its old value despite other components updating), we can do this with trees that take too long to render.
ja: 取得するのに時間のかかりすぎる値を「遅延」できる（そして他のコンポーネントが更新されているにも関わらず古い値を表示できる）のと全く同様に、レンダーに時間のかかりすぎるツリーに対しても同じことが行えます。

source: For example, consider a filterable list like this:
ja: 例えば以下のようなフィルタ可能なリストを考えてみましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/pensive-shirley-wkp46)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/pensive-shirley-wkp46)**

source: In this example, **every item in `<MySlowList>` has an artificial slowdown -- each of them blocks the thread for a few milliseconds**.
ja: この例では、**`<MySlowList>` 内のすべての要素に人為的な遅延を作っています -- すべての要素がスレッドを数 ms ずつブロックしているのです**。

source: We'd never do this in a real app, but this helps us simulate what can happen in a deep component tree with no single obvious place to optimize.
ja: 現実のアプリケーションでこんなことは絶対にやりませんが、深いコンポーネントツリーがあって単一の最適化可能部位が明確には存在しない場合に起こることをシミュレートできます。

source: We can see how typing in the input causes stutter.
ja: 入力欄にタイプすると引っかかりが発生していることが分かるでしょう。

source: Now let's add `useDeferredValue`:
ja: では `useDeferredValue` を加えましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/infallible-dewdney-9fkv9)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/infallible-dewdney-9fkv9)**

source: Now typing has a lot less stutter -- although we pay for this by showing the results with a lag.
ja: これでタイピングした際の引っかかりは大幅に軽減されました -- ただし結果の表示に遅延が生じることと引き替えに、です。

source: How is this different from debouncing?
ja: これはデバウンス (debounce) とどう異なるのでしょうか？

source: Our example has a fixed artificial delay (3ms for every one of 80 items), so there is always a delay, no matter how fast our computer is.
ja: 我々の例では人為的な固定の遅延時間（80 個の要素それぞれに 3 ms）があるため、どんなにコンピュータが高速でも必ず遅延が発生します。

source: However, the `useDeferredValue` value only "lags behind" if the rendering takes a while.
ja: しかし `useDeferredValue` の値は、レンダーに時間がかかっている場合にのみ「遅れ」が生じるのです。

source: There is no minimal lag imposed by React.
ja: React によって最低これだけラグが生じると決められているわけではありません。

source: With a more realistic workload, you can expect the lag to adjust to the user’s device.
ja: より現実的なワークロードでは、ユーザのデバイスによってラグの適応が起こることが期待できます。

source: On fast machines, the lag would be smaller or non-existent, and on slow machines, it would be more noticeable.
ja: 高速なマシンではラグは小さいか存在しなくなり、遅いマシンではラグはより目立つでしょう。

source: In both cases, the app would remain responsive.
ja: どちらのケースでも、アプリケーションはレスポンシブに保たれます。

source: That’s the advantage of this mechanism over debouncing or throttling, which always impose a minimal delay and can't avoid blocking the thread while rendering.
ja: デバウンスやスロットル (throttle) では常に少々の遅延が発生し、レンダー中にスレッドがブロックされることを防げませんので、これが本メカニズムの利点ということです。
